In [1]:
import pandas as pd
# Use pip or conda to install openpyxl

In [2]:
df = pd.read_excel("Data/online_retail_II.xlsx")

In [3]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [5]:
df.shape

(525461, 8)

In [10]:
df.columns.to_list()

['Invoice',
 'StockCode',
 'Description',
 'Quantity',
 'InvoiceDate',
 'Price',
 'Customer ID',
 'Country']

In [38]:
a = df.isnull().sum().rename("missing_values")
b = df.count().rename("totalvalues")
c = round((df.isnull().sum()/df.count())*100,2).rename("percentage")
missingdata = pd.concat([a,b,c], axis= 1)
missingdata

             missing_values  totalvalues  percentage
Invoice                   0       525461        0.00
StockCode                 0       525461        0.00
Description            2928       522533        0.56
Quantity                  0       525461        0.00
InvoiceDate               0       525461        0.00
Price                     0       525461        0.00
Customer ID          107927       417534       25.85
Country                   0       525461        0.00

In [65]:
maxorder= df.groupby(['Country'])['Quantity'].sum().sort_values(ascending= False)
maxorder = maxorder.reset_index(name = "no_of_ordders")
maxorder.head(5)

          Country  no_of_ordders
0  United Kingdom        4429046
1         Denmark         227030
2            EIRE         188704
3     Netherlands         181823
4         Germany         107133